# 处理缺失数据
### 对于数值数据，pandas使用浮点值NaN（Not a Number） 表示缺失数据，也称为哨兵值

In [1]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark','artichole',np.nan,'avocado'])
string_data

0     aardvark
1    artichole
2          NaN
3      avocado
dtype: object

In [2]:
# 检测哨兵值
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [3]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

# 滤除缺失数据

In [4]:
# Series中用dropna方法过滤缺失值
from numpy import nan as NA
data = pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [5]:
# 等价于
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
# 对于DataFrame，dropna默认丢弃任何含有缺失值的行
data = pd.DataFrame([[1,6.5,3],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [7]:
# 传入how='all',将只丢弃全为NA的那些行
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [8]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [9]:
# 用dropna方法丢弃全为NA的列，传入axis=1
data.dropna(how='all',axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0  2.242757  1.746223  0.534431
1 -1.093069 -1.191544  1.432162
2  0.691263  0.369080  0.217664
3 -0.115856 -0.700428 -2.400314
4  0.320719 -0.187030  0.892798
5  0.019511 -2.170003  0.916787
6  0.637324 -1.646791 -0.379590

In [11]:
df.iloc[:4,1] = NA
df

          0         1         2
0  2.242757       NaN  0.534431
1 -1.093069       NaN  1.432162
2  0.691263       NaN  0.217664
3 -0.115856       NaN -2.400314
4  0.320719 -0.187030  0.892798
5  0.019511 -2.170003  0.916787
6  0.637324 -1.646791 -0.379590

In [12]:
df.iloc[:2,2] = NA
df

          0         1         2
0  2.242757       NaN       NaN
1 -1.093069       NaN       NaN
2  0.691263       NaN  0.217664
3 -0.115856       NaN -2.400314
4  0.320719 -0.187030  0.892798
5  0.019511 -2.170003  0.916787
6  0.637324 -1.646791 -0.379590

In [13]:
# 删除含有缺失值NA的所有行
df.dropna()

          0         1         2
4  0.320719 -0.187030  0.892798
5  0.019511 -2.170003  0.916787
6  0.637324 -1.646791 -0.379590

In [14]:
# 传入thresh参数只留下一部分观测数据
df.dropna(thresh=2)

          0         1         2
2  0.691263       NaN  0.217664
3 -0.115856       NaN -2.400314
4  0.320719 -0.187030  0.892798
5  0.019511 -2.170003  0.916787
6  0.637324 -1.646791 -0.379590

# 填充缺失数据
## 参数说明
- axis---------待填充的轴，默认axis=0
- inplace------修改调用者对象而不产生副本
- limit--------（对于前向和后向填充）可以连续填充的最大数量

In [15]:
df

          0         1         2
0  2.242757       NaN       NaN
1 -1.093069       NaN       NaN
2  0.691263       NaN  0.217664
3 -0.115856       NaN -2.400314
4  0.320719 -0.187030  0.892798
5  0.019511 -2.170003  0.916787
6  0.637324 -1.646791 -0.379590

In [16]:
# 通过调用fillna 函数，将缺失值替换为常数值
df.fillna(0)

          0         1         2
0  2.242757  0.000000  0.000000
1 -1.093069  0.000000  0.000000
2  0.691263  0.000000  0.217664
3 -0.115856  0.000000 -2.400314
4  0.320719 -0.187030  0.892798
5  0.019511 -2.170003  0.916787
6  0.637324 -1.646791 -0.379590

In [17]:
# 调用字典，实现对不同的列填充不同的值
df.fillna({1:0.5,2:0})

          0         1         2
0  2.242757  0.500000  0.000000
1 -1.093069  0.500000  0.000000
2  0.691263  0.500000  0.217664
3 -0.115856  0.500000 -2.400314
4  0.320719 -0.187030  0.892798
5  0.019511 -2.170003  0.916787
6  0.637324 -1.646791 -0.379590

In [18]:
_ = df.fillna(0,inplace=True)

In [19]:
df

          0         1         2
0  2.242757  0.000000  0.000000
1 -1.093069  0.000000  0.000000
2  0.691263  0.000000  0.217664
3 -0.115856  0.000000 -2.400314
4  0.320719 -0.187030  0.892798
5  0.019511 -2.170003  0.916787
6  0.637324 -1.646791 -0.379590

In [20]:
df = pd.DataFrame(np.random.randn(6,3))
df

          0         1         2
0 -1.486104 -0.010054 -0.159040
1  1.218866 -0.772697 -0.379401
2 -0.773743  0.527449 -0.371148
3 -0.454205  0.221553 -0.045411
4  0.754663 -0.673958  1.374485
5  0.019130 -0.579937  0.375823

In [21]:
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA
df

          0         1         2
0 -1.486104 -0.010054 -0.159040
1  1.218866 -0.772697 -0.379401
2 -0.773743       NaN -0.371148
3 -0.454205       NaN -0.045411
4  0.754663       NaN       NaN
5  0.019130       NaN       NaN

In [22]:
# 限制填充的数量个数
df.fillna(method='ffill',limit=3)

          0         1         2
0 -1.486104 -0.010054 -0.159040
1  1.218866 -0.772697 -0.379401
2 -0.773743 -0.772697 -0.371148
3 -0.454205 -0.772697 -0.045411
4  0.754663 -0.772697 -0.045411
5  0.019130       NaN -0.045411

In [23]:
data = pd.Series([1.,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [24]:
# 用其平均数填充缺失值
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 数据转换

In [25]:
# 移除重复数据
data = pd.DataFrame({'k1':['one','two'] * 3 + ['two'],
                    'k2':[1,1,2,3,3,4,4,]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [26]:
# duplicated方法返回布尔型Series,表示各行是否是重复行（前面出现过得行）
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [27]:
# drop_duplicates方法返回一个DataFrame,重复的shu'zu会标为Fasle
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [28]:
# 增加一列v1
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [29]:
# 只根据k1列过滤重复项
data.drop_duplicates('k1')

    k1  k2  v1
0  one   1   0
1  two   1   1

# 利用函数或映射进行数据转换

In [30]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork','bacon',
                              'Pastrami', 'corned beef','Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [31]:
# 要添加一列表示该肉类食物来源的动物类型
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [32]:
# 转换为小写
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [33]:
# Series的map方法可以接受一个函数或者含有映射关系的字典型对象
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [34]:
# 传入能够完全完成全部工作的函数
data['food'].map(lambda x : meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [35]:
# 替换值
data = pd.Series([1.,-999,2,-999,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [36]:
# -999可能表示的是缺失数据的标记值，使用replace替换为可处理的NaN值
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [37]:
# 一次替换多个值(传入待替换值组成的列表及替换值)
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [38]:
# 每个值有不同的替换值，传递替换列表
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [39]:
# 传入的参数也可以是字典
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

# 重命名轴索引

In [40]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [41]:
# 用map方法重命名轴
transform = lambda x:x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [42]:
# 如果不修改原始数据，使用rename方法
data.rename(index=str.title,columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [43]:
# 原地修改
data.rename(inplace=True,index={'Ohio':'vodka'})
data

          one  two  three  four
vodka       0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

# 离散化和面元划分
### 为了便于分析，连续数据被离散化或拆分为‘面元’

In [44]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18,25,35,60,100]
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [45]:
# 划分为四类
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [46]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [47]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [48]:
# 传递一个列表或元组到labels，设置面元名称
group_names = ['Youth', 'YoungAdult', 'MiddleAged','Senior']
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [49]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

# 检测和过滤异常值

In [50]:
data = pd.DataFrame(np.random.randn(1000,4))
data

            0         1         2         3
0    0.838959 -0.190797 -0.471188  0.933171
1   -1.425523  1.654092  1.285558 -1.013586
2    1.063699  2.189555 -0.354101 -0.693268
3   -1.809389 -0.558076  0.174154  0.241831
4   -0.436183  0.188282 -0.416969 -0.039667
5    0.074087 -0.062923 -1.114759 -1.752729
6    0.723641  0.385807 -1.538819 -0.463697
7   -0.464642 -0.349549 -0.663412  0.284046
8   -0.621630 -0.217901 -1.472026  0.403888
9   -1.322585 -0.777884  3.063282 -1.397117
10   0.622426  0.430603  0.363811 -1.183694
11  -1.716314 -0.139617  0.251439 -0.019198
12   0.457064  0.029175 -0.437554  0.788562
13   0.327992  0.809472  0.256969 -0.531583
14   0.016248  1.295163  0.260562 -0.085521
15   0.763006  0.817660 -0.222692  0.623772
16   0.889189  0.864922  0.761070 -0.440384
17   0.374020  0.788228 -0.758022  0.912084
18  -0.280815 -0.344309  1.481343 -0.881882
19  -0.224819  2.126256  0.491494 -1.135340
20  -0.454694  1.188926  2.903098 -1.250421
21  -0.153968  1.164916  0.468303 -1.158012
22  -0.488933 -1.122717  0.239425 -0.114930
23  -0.802637 -1.936724  2.142494  1.011176
24  -1.611489  1.460101 -1.435543 -0.397831
25  -0.495309  0.626751 -0.530006  0.916477
26   0.179466 -0.994299 -0.755267  0.273438
27   0.762450  1.334327  0.385802  0.343035
28  -1.087877  0.712440 -0.282662 -1.455999
29   0.038046 -0.744599  0.360309 -0.572372
..        ...       ...       ...       ...
970  1.251485 -0.857270  0.724801  0.409309
971 -1.001085  1.473358  0.762105 -1.082877
972 -0.561715 -0.045808 -0.822669 -0.300678
973  2.276739 -0.813413 -1.422719 -0.117699
974  0.345361 -0.795846 -0.039563  1.768403
975  0.567183  0.431909  0.175009 -0.244290
976 -0.462497  0.870100  1.381186 -0.422719
977  2.086126 -1.072781 -0.094559 -1.656257
978 -0.210632 -0.798898 -0.692058  0.949147
979  0.016160 -0.145381 -0.456759 -1.664482
980  0.402741  1.258219  1.746012  1.322226
981  0.544330 -1.030294 -0.405195  0.502557
982  0.343472 -0.718010 -0.595654  0.358890
983 -1.888922  0.729807  0.847033 -0.595383
984  0.360888 -0.445822 -1.051545 -1.501241
985  0.153722  0.227310 -1.520514 -0.217217
986 -0.584745 -1.157059 -0.251244 -1.413024
987 -0.806334 -0.815291  1.008734 -0.889139
988  0.270857 -1.442514 -1.519667 -1.031482
989  1.374471 -1.544372  1.706167  0.638143
990 -1.220638 -0.805301  1.563912  0.045714
991  0.096581 -0.211059 -0.236371 -0.078157
992  0.376503 -0.259551  0.238911 -0.447407
993 -1.315356  0.219209 -0.424379 -1.607731
994 -1.673996  1.562583  0.124285  0.243500
995  0.319361  1.323643 -0.484607 -0.699440
996 -0.752363 -0.092236  0.396289 -1.174179
997  0.535683  1.438964 -0.704474  0.481215
998  0.380542  0.380700  1.961709  0.926507
999  0.733092 -0.101687 -0.288499 -0.674539

[1000 rows x 4 columns]

In [51]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.033898     0.013474     0.046211    -0.006461
std       0.977073     0.984478     1.004088     0.989697
min      -3.063842    -3.020266    -3.784706    -3.236205
25%      -0.714983    -0.675213    -0.649831    -0.661904
50%       0.005438     0.024654     0.055245     0.008942
75%       0.614244     0.664753     0.680701     0.660204
max       3.061514     4.274232     3.208364     3.127134

In [52]:
# 找出某列中绝对值大小超过3的值
col = data[2]
col[np.abs(col)>3]

9      3.063282
59    -3.784706
791    3.208364
Name: 2, dtype: float64

In [53]:
# 选出全部超过3或-3的值，使用any方法
data[(np.abs(data)>3).any(1)]

            0         1         2         3
9   -1.322585 -0.777884  3.063282 -1.397117
59   0.628608 -0.778919 -3.784706 -1.086592
137  0.051107 -3.020266 -1.800323 -1.589247
216  0.267638  1.057795  0.630461 -3.236205
221 -3.063842  0.674270 -0.406272 -0.758608
256 -2.595387  4.274232 -0.414059  0.199532
393  1.124191 -0.897925  0.458318  3.127134
414  0.543839 -0.398080  0.705451 -3.027299
791  0.951094  0.251515  3.208364  2.042716
841  3.061514 -1.584037 -0.938810 -0.003056

In [54]:
# 将值限制在区间-3到3内
data[np.abs(data)>3] = np.sign(data)>3
data.describe()

            0      1      2      3
count    1000   1000   1000   1000
unique    999    999    998    998
top     False  False  False  False
freq        2      2      3      3

In [55]:
# 根据值是正还是负，生成1和-1
np.sign(data).head()

    0   1   2   3
0   1  -1  -1   1
1  -1   1   1  -1
2   1   1  -1  -1
3  -1  -1   1   1
4  -1   1  -1  -1

# 排列和随机采样

In [56]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [57]:
sampler = np.random.permutation(5)
sampler

array([2, 0, 4, 1, 3])

In [58]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
0   0   1   2   3
4  16  17  18  19
1   4   5   6   7
3  12  13  14  15

In [59]:
df.sample(n=3)

   0  1   2   3
2  8  9  10  11
0  0  1   2   3
1  4  5   6   7

In [60]:
choices = pd.Series([5,7,-1,6,4])
draws = choices.sample(n=10,replace=True)
draws

3    6
0    5
3    6
3    6
2   -1
1    7
3    6
2   -1
3    6
0    5
dtype: int64

# 计算指标，哑变量

In [61]:
# 将分类变量转换为‘哑变量’或‘指标矩阵’
df = pd.DataFrame({'key':['b','b','a','c','a','b'],
                  'data1':range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [62]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [63]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [64]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# 字符串操作

In [65]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [66]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [67]:
first,second,third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [68]:
# python化连接
'::'.join(pieces)

'a::b::guido'

# 正则表达式

In [69]:
import re
text = 'foo   bar\t baz   \tqux'
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [70]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [71]:
regex.findall(text)

['   ', '\t ', '   \t']

In [72]:
# 如果打算对许多字符串应用同一条正则表达式，强烈建议通过re.compile 创建regex 对象。这样将可以节省大量的CPU 时间。

# Pandas的矢量化字符串函数

In [76]:
data = {'Dave': 'dave@google.com', 'Steve':'steve@gmail.com','Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [77]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [81]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object